; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-3-36)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p2-0 - location
	p2-3 - location
	p2-5 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p4-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s5)
	(at driver3 s2)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s2)
	(at package2 s5)
	(at package3 s0)
	(at package4 s2)
	(at package5 s3)
	(at package6 s0)
	(at package7 s4)
	(at package8 s2)
	(at package9 s3)
	(at package10 s5)
	(at package11 s3)
	(at package12 s0)
	(at package13 s2)
	(at package14 s3)
	(at package15 s0)
	(at package16 s5)
	(at package17 s1)
	(at package18 s5)
	(at package19 s5)
	(at package20 s0)
	(at package21 s4)
	(at package22 s2)
	(at package23 s0)
	(at package24 s1)
	(at package25 s0)
	(at package26 s5)
	(at package27 s4)
	(at package28 s3)
	(at package29 s3)
	(at package30 s0)
	(at package31 s4)
	(at package32 s0)
	(at package33 s0)
	(at package34 s0)
	(at package35 s0)
	(at package36 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s1)
	(at truck1 s1)
	(at truck2 s2)
	(at truck3 s2)
	(at package1 s5)
	(at package2 s0)
	(at package3 s3)
	(at package4 s3)
	(at package5 s5)
	(at package6 s5)
	(at package7 s1)
	(at package8 s0)
	(at package9 s2)
	(at package10 s1)
	(at package11 s4)
	(at package12 s4)
	(at package13 s4)
	(at package14 s1)
	(at package15 s4)
	(at package16 s5)
	(at package17 s3)
	(at package18 s5)
	(at package19 s3)
	(at package20 s3)
	(at package21 s1)
	(at package22 s1)
	(at package23 s4)
	(at package24 s1)
	(at package25 s2)
	(at package26 s2)
	(at package27 s4)
	(at package28 s3)
	(at package29 s2)
	(at package30 s3)
	(at package31 s2)
	(at package32 s4)
	(at package33 s4)
	(at package34 s5)
	(at package35 s0)
	(at package36 s0)
	))


)

; plan
1. (board-truck driver3 s2 truck2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 42
2. (load-truck s2 package8 truck2)
   deleted: (at package8 s2)
   added: (in package8 truck2)
   goals met: 8 of 42
3. (drive-truck driver3 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 7 of 42
4. (unload-truck s0 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s0)
   goals met: 8 of 42
5. (load-truck s0 package6 truck2)
   deleted: (at package6 s0)
   added: (in package6 truck2)
   goals met: 8 of 42
6. (drive-truck driver3 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 9 of 42
7. (load-truck s2 package4 truck2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 9 of 42
8. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 8 of 42
9. (load-truck s3 package9 truck2)
   deleted: (at package9 s3)
   added: (in package9 truck2)
   goals met: 8 of 42
10. (load-truck s3 package5 truck2)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 8 of 42
11. (drive-truck driver3 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 9 of 42
12. (unload-truck s2 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s2)
   goals met: 10 of 42
13. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 10 of 42
14. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 9 of 42
15. (unload-truck s3 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   goals met: 10 of 42
16. (load-truck s3 package29 truck2)
   deleted: (at package29 s3)
   added: (in package29 truck2)
   goals met: 10 of 42
17. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 10 of 42
18. (drive-truck driver3 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 11 of 42
19. (unload-truck s2 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s2)
   goals met: 12 of 42
20. (load-truck s2 package13 truck2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 12 of 42
21. (drive-truck driver3 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 11 of 42
22. (load-truck s0 package34 truck2)
   deleted: (at package34 s0)
   added: (in package34 truck2)
   goals met: 11 of 42
23. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 11 of 42
24. (unload-truck s1 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s1)
   goals met: 12 of 42
25. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 12 of 42
26. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 13 of 42
27. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 12 of 42
28. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 13 of 42
29. (load-truck s3 package14 truck2)
   deleted: (at package14 s3)
   added: (in package14 truck2)
   goals met: 13 of 42
30. (drive-truck driver3 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 13 of 42
31. (unload-truck s1 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s1)
   goals met: 14 of 42
32. (drive-truck driver3 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 15 of 42
33. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 15 of 42
34. (walk driver2 s5 p2-5)
   deleted: (at driver2 s5)
   added: (at driver2 p2-5)
   goals met: 15 of 42
35. (walk driver2 p2-5 s2)
   deleted: (at driver2 p2-5)
   added: (at driver2 s2)
   goals met: 16 of 42
36. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   goals met: 15 of 42
37. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   goals met: 15 of 42
38. (board-truck driver2 s4 truck3)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 15 of 42
39. (drive-truck driver3 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 14 of 42
40. (unload-truck s5 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   goals met: 15 of 42
41. (unload-truck s5 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s5)
   goals met: 16 of 42
42. (load-truck s5 package36 truck2)
   deleted: (at package36 s5)
   added: (in package36 truck2)
   goals met: 16 of 42
43. (unload-truck s5 package34 truck2)
   deleted: (in package34 truck2)
   added: (at package34 s5)
   goals met: 17 of 42
44. (load-truck s5 package26 truck2)
   deleted: (at package26 s5)
   added: (in package26 truck2)
   goals met: 17 of 42
45. (load-truck s5 package2 truck2)
   deleted: (at package2 s5)
   added: (in package2 truck2)
   goals met: 17 of 42
46. (drive-truck driver3 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 17 of 42
47. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 17 of 42
48. (unload-truck s0 package36 truck2)
   deleted: (in package36 truck2)
   added: (at package36 s0)
   goals met: 18 of 42
49. (load-truck s0 package33 truck2)
   deleted: (at package33 s0)
   added: (in package33 truck2)
   goals met: 18 of 42
50. (load-truck s0 package32 truck2)
   deleted: (at package32 s0)
   added: (in package32 truck2)
   goals met: 18 of 42
51. (load-truck s0 package30 truck2)
   deleted: (at package30 s0)
   added: (in package30 truck2)
   goals met: 18 of 42
52. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 18 of 42
53. (load-truck s0 package25 truck2)
   deleted: (at package25 s0)
   added: (in package25 truck2)
   goals met: 18 of 42
54. (drive-truck driver3 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 19 of 42
55. (unload-truck s2 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s2)
   goals met: 20 of 42
56. (drive-truck driver3 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 19 of 42
57. (unload-truck s3 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s3)
   goals met: 20 of 42
58. (unload-truck s3 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   goals met: 21 of 42
59. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 21 of 42
60. (load-truck s0 package23 truck2)
   deleted: (at package23 s0)
   added: (in package23 truck2)
   goals met: 21 of 42
61. (drive-truck driver3 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 22 of 42
62. (unload-truck s2 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s2)
   goals met: 23 of 42
63. (load-truck s4 package7 truck3)
   deleted: (at package7 s4)
   added: (in package7 truck3)
   goals met: 23 of 42
64. (load-truck s4 package31 truck3)
   deleted: (at package31 s4)
   added: (in package31 truck3)
   goals met: 23 of 42
65. (drive-truck driver2 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 23 of 42
66. (drive-truck driver3 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 22 of 42
67. (unload-truck s4 package33 truck2)
   deleted: (in package33 truck2)
   added: (at package33 s4)
   goals met: 23 of 42
68. (unload-truck s4 package32 truck2)
   deleted: (in package32 truck2)
   added: (at package32 s4)
   goals met: 24 of 42
69. (unload-truck s4 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s4)
   goals met: 25 of 42
70. (drive-truck driver3 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 25 of 42
71. (load-truck s0 package20 truck3)
   deleted: (at package20 s0)
   added: (in package20 truck3)
   goals met: 25 of 42
72. (drive-truck driver2 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 26 of 42
73. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 26 of 42
74. (unload-truck s0 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   goals met: 27 of 42
75. (drive-truck driver3 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 27 of 42
76. (load-truck s4 package21 truck2)
   deleted: (at package21 s4)
   added: (in package21 truck2)
   goals met: 27 of 42
77. (drive-truck driver3 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 27 of 42
78. (unload-truck s1 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s1)
   goals met: 28 of 42
79. (drive-truck driver3 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 28 of 42
80. (load-truck s5 package19 truck2)
   deleted: (at package19 s5)
   added: (in package19 truck2)
   goals met: 28 of 42
81. (drive-truck driver3 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 28 of 42
82. (unload-truck s3 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s3)
   goals met: 29 of 42
83. (load-truck s3 package11 truck2)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   goals met: 29 of 42
84. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 29 of 42
85. (drive-truck driver3 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 29 of 42
86. (unload-truck s4 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s4)
   goals met: 30 of 42
87. (unload-truck s4 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s4)
   goals met: 31 of 42
88. (drive-truck driver3 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 31 of 42
89. (load-truck s0 package15 truck2)
   deleted: (at package15 s0)
   added: (in package15 truck2)
   goals met: 31 of 42
90. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 31 of 42
91. (unload-truck s2 package31 truck3)
   deleted: (in package31 truck3)
   added: (at package31 s2)
   goals met: 32 of 42
92. (drive-truck driver3 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 32 of 42
93. (unload-truck s4 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s4)
   goals met: 33 of 42
94. (drive-truck driver3 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 33 of 42
95. (drive-truck driver3 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 33 of 42
96. (load-truck s5 package10 truck2)
   deleted: (at package10 s5)
   added: (in package10 truck2)
   goals met: 33 of 42
97. (drive-truck driver3 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 33 of 42
98. (unload-truck s1 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s1)
   goals met: 34 of 42
99. (drive-truck driver3 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 34 of 42
100. (unload-truck s5 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   goals met: 35 of 42
101. (drive-truck driver3 s5 s1 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   goals met: 35 of 42
102. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 35 of 42
103. (load-truck s0 package12 truck2)
   deleted: (at package12 s0)
   added: (in package12 truck2)
   goals met: 35 of 42
104. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 35 of 42
105. (drive-truck driver3 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 35 of 42
106. (unload-truck s4 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   goals met: 36 of 42
107. (drive-truck driver2 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 35 of 42
108. (unload-truck s1 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   goals met: 36 of 42
109. (drive-truck driver2 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 37 of 42
110. (drive-truck driver2 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 36 of 42
111. (unload-truck s3 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s3)
   goals met: 37 of 42
112. (drive-truck driver2 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 38 of 42
113. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 39 of 42
114. (disembark-truck driver3 s4 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 39 of 42
115. (board-truck driver3 s4 truck1)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 39 of 42
116. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 40 of 42
117. (disembark-truck driver3 s1 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 41 of 42
118. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   goals met: 40 of 42
119. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   goals met: 40 of 42
120. (board-truck driver2 s4 truck2)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 40 of 42
121. (drive-truck driver2 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 41 of 42
122. (disembark-truck driver2 s2 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 42 of 42
